app/views/requests/index.html.erb

  </tr>
  <% @employee.requests.each do |request| %>
---
SELECT "requests".* FROM "requests" WHERE "requests"."employee_id" = ?  [["employee_id", 3]]