app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "employees"
SELECT COUNT(*) FROM "requests"
SELECT COUNT(*) FROM "events"
SELECT COUNT(*) FROM "projects"
---
  def index
    @employees = Employee.count
    @requests = Request.count
    @events = Event.count
    @projects = Project.count