app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    # This statement shows the page for a new employee if it was not saved in the table, if it was saved, it shows the profile created
    if @employee.save
---
INSERT INTO "employees" ("full_name", "address", "phone", "email", "role", "area", "contract_duration", "contract_term", "admission_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @employee = Employee.find(params[:id])

    if @employee.update(employee_params)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "employees" SET "address" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["address", "nonanna"], ["updated_at", "2015-08-05 17:59:52.875217"], ["id", 4]]

  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 2]]