app/controllers/events_controller.rb

  def listing
    @events = Event.all
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("event_name", "event_details", "event_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)