app/controllers/projects_controller.rb

  def listing
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("project_name", "area", "manager", "team", "project_kickoff", "project_deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)