app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests" WHERE (employee.full_name LIKE '%Talita Silva Lima%')  ORDER BY created_at DESC
---
  def listing
    @requests = Request.all

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 3]]
SELECT "requests".* FROM "requests" WHERE "requests"."employee_id" = ?  [["employee_id", 3]]
---
  def index
    @employee = Employee.find(params[:employee_id])
    @request = @employee.requests.all

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @request = Request.find_by(id: params[:id])

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 3]]
---
  def new
    @employee = Employee.find(params[:employee_id])

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "requests" ("considerations", "start_date", "end_date", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.find(params[:employee_id])
    @request = @employee.requests.create(request_params)

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 12]]
---
  def destroy
    @request = Request.find_by(id: params[:id])
    @request.destroy