app/controllers/welcome_controller.rb

  def index
     @employee = Employee.where(email: current_user.email).first
---
SELECT  "employees".* FROM "employees" WHERE "employees"."email" = ?  ORDER BY "employees"."id" ASC LIMIT 1  [["email", "tsl_sp@msn.com"]]